In [1]:
import pandas as pd
import numpy as np

two objects : series(columns) and dataframe(table)

In [2]:
n1=pd.Series([100,200,300],index=['a','b','c'])

In [3]:
n1

a    100
b    200
c    300
dtype: int64

In [4]:
n1.index=["aa","bb","cc"]
n1

aa    100
bb    200
cc    300
dtype: int64

In [5]:
n1[0]

C:\Users\asus\AppData\Local\Temp\ipykernel_2608\460056605.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  n1[0]

np.int64(100)

In [6]:
n1["aa"]

np.int64(100)

In [7]:
type(n1)

pandas.core.series.Series

In [21]:
df=pd.DataFrame({"Name":["abc","xyz","pqr"],
                 "Marks":[100,200,300],
                 "Subjects":["Maths","Physics","Chemistry"],
                "RollNo":[1,2,3]})

In [9]:
df

  Name  Marks   Subjects
0  abc    100      Maths
1  xyz    200    Physics
2  pqr    300  Chemistry

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [12]:
df.columns

Index(['Name', 'Marks', 'Subjects'], dtype='object')

In [13]:
df['Name']

0    abc
1    xyz
2    pqr
Name: Name, dtype: object

In [14]:
type(df['Marks'])

pandas.core.series.Series

In [23]:
df['Name']=['a','b','c']
df

  Name  Marks   Subjects  RollNo
0    a    100      Maths       1
1    b    200    Physics       2
2    c    300  Chemistry       3

loc and iloc function

In [27]:
df.iloc[0::2,0::2]  # start_row:end_row:row_step, start_col:end_col:col_step

  Name   Subjects
0    a      Maths
2    c  Chemistry